/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   minirt.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jooahn <jooahn@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/02/19 19:29:32 by seongmik          #+#    #+#             */
/*   Updated: 2024/02/19 20:02:06 by jooahn           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include "minirt.h"

int	main(int argc, char *argv[])
{
	if (argc == 3 && ft_str_is_same(argv[2], "--save"))
	{
		// 렌더링 된 이미지를 bmp 형식으로 변환해 저장.
	}
	if (argc == 2)
	{
		// mlx 창 오픈
		parser(argv[1]);
	}
	return (0);
}
